{"itemid":"372770","languages":{"english":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature is difficult platformer with puzzle color mechanics.[\/h2]\r\n\r\n[b]Play over 350 levels[\/b] with diverse gameplay that have various items, blocks and hazards, one of the items change gravity and player speed, give you an ability to jump higher, teleport from one place to the other and etc!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]The Level Editor let's you build levels and it has over 110 placeable blocks and items![\/b] Other main features in the level editor are saving\/loading multiple levels, enabling fog, changing music, applying narrator text, and play\/build mode. There are litetally millions of different level combinations and hours of fun! Finally, you can also put your levels on the Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Local Multiplayer can be played with 2, 3 or 4 players![\/b] All of the players can customize their look with unlocked skins and hats, and can change controls with 4 presets. Local Multiplayer currently offers two gamemodes, [b]Survival[\/b] and [b]Race[\/b], but we plan adding more, all gamemodes are compatible with all players.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]If you want to play through the endless queue of hand-crafted levels, try this gamemode![\/b] Three gamemodes are available for Endless Run, those gamemodes are Normal, Old School and Custom Endless Run.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nYou can customize your character with skins and hats. Skins are obtained by doing various tasks and most hats are obtained at the hat merchant shop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature has been open sourced[\/b], making it easier than ever to modify code and improve the game further! Consider helping by going to TheColorfulCreature repo on GitHub!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]This game has a lot more features than that![\/b] We are hoping to add more and you to enjoy our game!\r\n\r\n[h2][b]IS THIS GAME FOR YOU?[\/b][\/h2]\r\nIf you like difficult platformers, puzzle games to some extent, like to make your own levels in games, competing in leaderboards, speedrunning, then this game is for you!","app[content][short_description]":"The Colorful Creature is difficult platformer with puzzle color mechanics. Play over 350 levels with diverse gameplay that have many items and hazards, in-game level editor, local multiplayer, endless run, customizable skins &amp; hats, steam workshop and more!","app[content][sysreqs][mac][min][osversion]":"Get Windows VM, Apple User","app[content][sysreqs][mac][min][processor]":"You probably have an intel processor","app[content][sysreqs][mac][min][graphics]":"Idk","app[content][sysreqs][mac][min][notes]":"Jesse we have to get a VM Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][windows][min][soundcard]":"Do people even use these???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][linux][min][soundcard]":"Do people even use these???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"[h2]RELEASE 1.1[\/h2]\r\n- Overhaul to the progression and steam achievements\r\n- Improved controller support\r\n\r\n- THANK YOU SO MUCH FOR YOUR ONGOING SUPPORT!","app[content][sections][1][label]":"Steam Workshop","app[content][sections][1][content]":"Amazing user levels!","app[content][sections][2][content]":"","app[content][sections][3][label]":"","app[item_store][filters][0][localization]":"Skins","app[item_store][filters][1][localization]":"Hats","app[item_store][filters][2][localization]":"Items","app[item_store][filters][3][localization]":"Donations","app[item_store][filters][4][localization]":"Flags"},"french":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature est un jeu de plateforme difficile avec des mécaniques de puzzle de couleur.[\/h2]\r\n\r\n[b]Jouez à plus de 350 niveaux[\/b] avec un gameplay diversifié comprenant divers objets, blocs et dangers. L'un des objets change la gravité et la vitesse du joueur, vous donne la capacité de sauter plus haut, de vous téléporter d'un endroit à un autre, etc.!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]L'éditeur de niveaux vous permet de créer des niveaux et comprend plus de 110 blocs et objets à placer ![\/b] Les autres fonctionnalités principales de l'éditeur de niveaux incluent la sauvegarde\/le chargement de plusieurs niveaux, l'activation du brouillard, le changement de musique, l'application de textes narratifs et le mode jeu\/construction. Il y a littéralement des millions de combinaisons de niveaux différents et des heures de plaisir ! Enfin, vous pouvez également publier vos niveaux sur le Steam Workshop !\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Le mode multijoueur local peut être joué avec 2, 3 ou 4 joueurs ![\/b] Tous les joueurs peuvent personnaliser leur apparence avec des skins et chapeaux déverrouillés, et peuvent changer les contrôles avec 4 préréglages. Le mode multijoueur local propose actuellement deux modes de jeu, [b]Survie[\/b] et [b]Course[\/b], mais nous prévoyons d'en ajouter d'autres, tous les modes de jeu sont compatibles avec tous les joueurs.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Si vous souhaitez jouer à travers la file d'attente interminable de niveaux faits à la main, essayez ce mode de jeu ![\/b] Trois modes de jeu sont disponibles pour la course sans fin : Normal, Old School et course sans fin personnalisée.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nVous pouvez personnaliser votre personnage avec des skins et des chapeaux. Les skins sont obtenus en accomplissant diverses tâches et la plupart des chapeaux sont obtenus dans la boutique de chapeaux !\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature est devenu open source[\/b], ce qui rend plus facile que jamais de modifier le code et d'améliorer le jeu davantage !\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Ce jeu a bien plus de fonctionnalités que cela ![\/b] Nous espérons en ajouter encore plus et que vous apprécierez notre jeu !\r\n\r\n[h2][b]CE JEU EST-IL POUR VOUS ?[\/b][\/h2]\r\nSi vous aimez les jeux de plateforme difficiles, les jeux de puzzle dans une certaine mesure, créer vos propres niveaux dans les jeux, concourir dans les classements, faire des speedruns, alors ce jeu est fait pour vous !","app[content][short_description]":"The Colorful Creature est un jeu de plateforme difficile avec des mécaniques de puzzle de couleur. Jouez à plus de 300 niveaux avec un gameplay diversifié comprenant de nombreux objets et dangers, un éditeur de niveaux intégré, un mode multijoueur local, une course sans fin, des skins et chapeaux personnalisables, le Steam Workshop et plus encore !","app[content][sysreqs][mac][min][osversion]":"Obtenez une VM Windows, utilisateur Apple","app[content][sysreqs][mac][min][processor]":"Vous avez probablement un processeur Intel","app[content][sysreqs][mac][min][graphics]":"Je ne sais pas","app[content][sysreqs][mac][min][notes]":"Jesse, nous devons obtenir une VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][windows][min][soundcard]":"Les gens utilisent-ils encore ça ???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][linux][min][soundcard]":"Les gens utilisent-ils encore ça ???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]VERSION 1.1[\/h2]\r\n- Révision de la progression et des succès Steam\r\n- Amélioration de la prise en charge des manettes\r\n\r\n- MERCI BEAUCOUP POUR VOTRE SOUTIEN CONTINU !","app[content][sections][2][content]":"Niveaux créés par des utilisateurs incroyables !","app[content][sections][3][label]":"Store !","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"italian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature è un difficile gioco di piattaforme con meccaniche basate sui colori.[\/h2]\r\n\r\n[b]Gioca a oltre 350 livelli[\/b] con gameplay vario che include vari oggetti, blocchi e pericoli. Uno degli oggetti cambia la gravità e la velocità del giocatore, ti dà la capacità di saltare più in alto, teletrasportarti da un posto all'altro e altro ancora!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]L'editor di livelli ti consente di costruire livelli e include oltre 110 blocchi e oggetti posizionabili![\/b] Altre caratteristiche principali dell'editor di livelli sono il salvataggio\/caricamento di più livelli, l'attivazione della nebbia, il cambio della musica, l'applicazione di testi narrativi e la modalità di gioco\/costruzione. Ci sono letteralmente milioni di combinazioni di livelli diversi e ore di divertimento! Infine, puoi anche pubblicare i tuoi livelli nel Workshop di Steam!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]La modalità multigiocatore locale può essere giocata con 2, 3 o 4 giocatori![\/b] Tutti i giocatori possono personalizzare il proprio aspetto con skin e cappelli sbloccati e cambiare i controlli con 4 preimpostazioni. La modalità multigiocatore locale attualmente offre due modalità di gioco, [b]Sopravvivenza[\/b] e [b]Corsa[\/b], ma abbiamo in programma di aggiungerne altre. Tutte le modalità di gioco sono compatibili con tutti i giocatori.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Se vuoi giocare attraverso la coda infinita di livelli fatti a mano, prova questa modalità di gioco![\/b] Sono disponibili tre modalità di gioco per la corsa infinita: Normale, Old School e corsa infinita personalizzata.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nPuoi personalizzare il tuo personaggio con skin e cappelli. Le skin si ottengono completando vari compiti e la maggior parte dei cappelli si ottiene nel negozio di cappelli!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature è diventato open source[\/b], rendendo più facile che mai modificare il codice e migliorare ulteriormente il gioco!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Questo gioco ha molte più funzionalità![\/b] Speriamo di poterne aggiungere ancora e che ti piaccia il nostro gioco!\r\n\r\n[h2][b]QUESTO GIOCO È PER TE?[\/b][\/h2]\r\nSe ti piacciono i giochi di piattaforme difficili, i giochi di puzzle fino a un certo punto, creare i tuoi livelli nei giochi, competere nelle classifiche, fare speedruns, allora questo gioco è per te!","app[content][short_description]":"The Colorful Creature è un difficile gioco di piattaforme con meccaniche basate sui colori. Gioca a oltre 300 livelli con gameplay vario che include molti oggetti e pericoli, un editor di livelli in-game, modalità multigiocatore locale, corsa infinita, skin e cappelli personalizzabili, Steam Workshop e molto altro!","app[content][sysreqs][mac][min][osversion]":"Ottieni una VM Windows, utente Apple","app[content][sysreqs][mac][min][processor]":"Probabilmente hai un processore Intel","app[content][sysreqs][mac][min][graphics]":"Non ne ho idea","app[content][sysreqs][mac][min][notes]":"Jesse, dobbiamo ottenere una VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][windows][min][soundcard]":"Qualcuno usa ancora questa???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][linux][min][soundcard]":"Qualcuno usa ancora questa???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]VERSIONE 1.1[\/h2]\r\n- Revisione dei progressi e degli obiettivi di Steam\r\n- Miglioramento del supporto per il controller\r\n\r\n- GRAZIE MILLE PER IL VOSTRO CONTINUO SUPPORTO!","app[content][sections][2][content]":"Livelli creati dagli utenti incredibili!","app[content][sections][3][label]":"Store!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"german":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature ist ein schwieriges Plattformspiel mit Farbmechaniken.[\/h2]\r\n\r\n[b]Spiele über 350 Level[\/b] mit abwechslungsreichem Gameplay, das verschiedene Gegenstände, Blöcke und Gefahren enthält. Eines der Gegenstände ändert die Schwerkraft und die Geschwindigkeit des Spielers, gibt dir die Fähigkeit, höher zu springen, von einem Ort zum anderen zu teleportieren und mehr!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Der Level-Editor lässt dich Level bauen und hat über 110 platzierbare Blöcke und Gegenstände![\/b] Weitere Hauptfunktionen des Level-Editors sind das Speichern\/Laden mehrerer Level, das Aktivieren von Nebel, das Ändern der Musik, das Anwenden von Erzählertext und der Spiel-\/Bau-Modus. Es gibt buchstäblich Millionen verschiedener Level-Kombinationen und Stunden voller Spaß! Schließlich kannst du deine Level auch im Steam Workshop veröffentlichen!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Der lokale Mehrspielermodus kann mit 2, 3 oder 4 Spielern gespielt werden![\/b] Alle Spieler können ihr Aussehen mit freigeschalteten Skins und Hüten anpassen und die Steuerung mit 4 Voreinstellungen ändern. Der lokale Mehrspielermodus bietet derzeit zwei Spielmodi, [b]Überleben[\/b] und [b]Rennen[\/b], aber wir planen, weitere hinzuzufügen. Alle Spielmodi sind mit allen Spielern kompatibel.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Wenn du durch die endlose Warteschlange handgefertigter Level spielen möchtest, probiere diesen Spielmodus![\/b] Für den Endloslauf sind drei Spielmodi verfügbar: Normal, Old School und benutzerdefinierter Endloslauf.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nDu kannst deinen Charakter mit Skins und Hüten anpassen. Skins erhältst du durch verschiedene Aufgaben und die meisten Hüte bekommst du im Hutladen!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature ist Open Source geworden[\/b], was es einfacher denn je macht, den Code zu ändern und das Spiel weiter zu verbessern!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Dieses Spiel hat noch viel mehr Funktionen![\/b] Wir hoffen, dass wir noch mehr hinzufügen können und dass du unser Spiel genießt!\r\n\r\n[h2][b]IST DIESES SPIEL FÜR DICH?[\/b][\/h2]\r\nWenn du schwierige Plattformspiele magst, Puzzlespiele bis zu einem gewissen Grad, gerne deine eigenen Level in Spielen erstellst, dich in Bestenlisten messen möchtest, Speedruns liebst, dann ist dieses Spiel für dich!","app[content][short_description]":"The Colorful Creature ist ein schwieriges Plattformspiel mit Farbmechaniken. Spiele über 300 Level mit abwechslungsreichem Gameplay, das viele Gegenstände und Gefahren enthält, einen Level-Editor im Spiel, lokalen Mehrspielermodus, endlosen Lauf, anpassbare Skins &amp; Hüte, Steam Workshop und mehr!","app[content][sysreqs][mac][min][osversion]":"Holen Sie sich Windows VM, Apple-Benutzer","app[content][sysreqs][mac][min][processor]":"Sie haben wahrscheinlich einen Intel-Prozessor","app[content][sysreqs][mac][min][graphics]":"Keine Ahnung","app[content][sysreqs][mac][min][notes]":"Jesse, wir müssen eine VM besorgen, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][windows][min][soundcard]":"Benutzt das überhaupt jemand???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][linux][min][soundcard]":"Benutzt das überhaupt jemand???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]VERÖFFENTLICHUNG 1.1[\/h2]\r\n- Überarbeitung der Fortschritte und Steam-Erfolge\r\n- Verbesserter Controller-Support\r\n\r\n- VIELEN DANK FÜR IHRE UNTERSTÜTZUNG!","app[content][sections][2][content]":"Erstaunliche Benutzerlevel!","app[content][sections][3][label]":"Store!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"spanish":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature es un juego de plataformas desafiante con mecánicas basadas en colores.[\/h2]\r\n\r\n[b]Juega a más de 350 niveles[\/b] con una jugabilidad variada que incluye varios objetos, bloques y peligros. Uno de los objetos cambia la gravedad y la velocidad del jugador, te da la capacidad de saltar más alto, teletransportarte de un lugar a otro y mucho más.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]El editor de niveles te permite construir niveles e incluye más de 110 bloques y objetos colocables.[\/b] Las características principales del editor de niveles incluyen guardar\/cargar múltiples niveles, activar niebla, cambiar la música, aplicar textos narrativos y modo de juego\/construcción. ¡Hay literalmente millones de combinaciones de niveles diferentes y horas de diversión! Finalmente, también puedes publicar tus niveles en el Steam Workshop.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]El modo multijugador local se puede jugar con 2, 3 o 4 jugadores.[\/b] Todos los jugadores pueden personalizar su apariencia con skins y sombreros desbloqueados, y cambiar los controles con 4 preajustes. El modo multijugador local actualmente ofrece dos modos de juego, [b]Supervivencia[\/b] y [b]Carrera[\/b], pero planeamos agregar más. Todos los modos de juego son compatibles con todos los jugadores.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Si deseas jugar a través de la cola infinita de niveles hechos a mano, ¡prueba este modo de juego![\/b] Hay tres modos de juego disponibles para la carrera infinita: Normal, Old School y carrera infinita personalizada.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nPuedes personalizar tu personaje con skins y sombreros. Las skins se obtienen completando varias tareas y la mayoría de los sombreros se obtienen en la tienda de sombreros.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature se ha vuelto de código abierto[\/b], lo que facilita más que nunca modificar el código y mejorar el juego aún más.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]¡Este juego tiene muchas más características![\/b] Esperamos poder agregar más y que disfrutes nuestro juego.\r\n\r\n[h2][b]¿ES ESTE JUEGO PARA TI?[\/b][\/h2]\r\nSi te gustan los juegos de plataformas desafiantes, los juegos de rompecabezas hasta cierto punto, crear tus propios niveles en los juegos, competir en las tablas de clasificación, hacer speedruns, entonces este juego es para ti.","app[content][short_description]":"The Colorful Creature es un juego de plataformas desafiante con mecánicas basadas en colores. Juega a más de 300 niveles con una jugabilidad variada que incluye muchos objetos y peligros, un editor de niveles dentro del juego, modo multijugador local, carrera infinita, skins y sombreros personalizables, Steam Workshop y mucho más.","app[content][sysreqs][mac][min][osversion]":"Obtén una VM de Windows, usuario de Apple","app[content][sysreqs][mac][min][processor]":"Probablemente tengas un procesador Intel","app[content][sysreqs][mac][min][graphics]":"No tengo idea","app[content][sysreqs][mac][min][notes]":"Jesse, tenemos que conseguir una VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][windows][min][soundcard]":"¿Alguien todavía usa esto???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (lol)","app[content][sysreqs][linux][min][soundcard]":"¿Alguien todavía usa esto???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]VERSIÓN 1.1[\/h2]\r\n- Revisión de los logros y el progreso en Steam\r\n- Mejoras en el soporte del controlador\r\n\r\n- ¡MUCHAS GRACIAS POR SU APOYO CONTINUO!","app[content][sections][2][content]":"¡Niveles creados por usuarios increíbles!","app[content][sections][3][label]":"Store!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"bulgarian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature е предизвикателна платформена игра с цветни пъзел механики.[\/h2]\r\n\r\n[b]Играй в над 350 нива[\/b] и се наслади на разнообразна игра с различни обекти, блокове и опасности. Някои обекти могат да променят гравитацията и скоростта на играча, което позволява по-високи скокове, телепортиране и още много!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Редакторът на нива ти позволява да създаваш свои собствени нива с над 110 блока и обекта![\/b] Основните функции на редактора на нива включват запазване\/зареждане на множество нива, активиране на мъгла, смяна на музиката, добавяне на текстови разкази и превключване между игрови и строителен режим. Създай безкрайно забавление с милиони комбинации от нива! И накрая, можеш да публикуваш своите нива в Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Локалният мултиплейър ти позволява да играеш с 2, 3 или 4 играча![\/b] Всеки играч може да персонализира външния си вид с отключващи се кожи и шапки и да промени контролите с четири предварително зададени опции. В момента локалният мултиплейър има два режима на игра: [b]Оцеляване[\/b] и [b]Състезание[\/b], като се планира добавянето на още режими. Всички игрови режими поддържат всички играчи.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Ако искаш да бягаш в ръчно изработени безкрайни нива, опитай този игрови режим![\/b] Режимът на безкрайно бягане има три варианта: нормален режим, класически режим и персонализирано безкрайно бягане.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nМожеш да персонализираш своя герой с кожи и шапки. Кожите могат да бъдат отключени чрез завършване на различни задачи, а повечето шапки могат да бъдат закупени от магазина за шапки!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature е с отворен код[\/b], което прави още по-лесно модифицирането на кода и подобряването на играта.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]И още много в играта![\/b] Надяваме се да добавим още функции и се надяваме да се насладиш на нашата игра!\r\n\r\n[h2][b]Тази игра за теб ли е?[\/b][\/h2]\r\nАко обичаш предизвикателни платформени игри с елементи на пъзел, обичаш да създаваш свои собствени нива, да се състезаваш в класациите и да правиш скоростни бягания, то тази игра е за теб!","app[content][short_description]":"The Colorful Creature е предизвикателна платформена игра с цветни пъзел механики. Наслади се на над 300 нива с разнообразни обекти и опасности, вградения редактор на нива, локалния мултиплейър, безкрайното бягане, персонализируеми кожи и шапки, Steam Workshop и още много.","app[content][sysreqs][mac][min][osversion]":"Вземете Windows VM, потребители на Apple","app[content][sysreqs][mac][min][processor]":"Вероятно имате Intel процесор","app[content][sysreqs][mac][min][graphics]":"Неизвестно","app[content][sysreqs][mac][min][notes]":"Джеси, нуждаем се от VM, Джеси","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (ха-ха)","app[content][sysreqs][windows][min][soundcard]":"Още ли някой ползва това???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (ха-ха)","app[content][sysreqs][linux][min][soundcard]":"Още ли някой ползва това???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Версия 1.1[\/h2]\r\n- Подобрение на напредъка и постиженията в Steam\r\n- Подобрена поддръжка за контролери\r\n\r\n- Благодарим ви за постоянната подкрепа!","app[content][sections][2][content]":"Страхотни потребителски нива!","app[content][sections][3][label]":"Магазин!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"czech":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature je náročná plošinovka s barevnými puzzle mechanikami.[\/h2]\r\n\r\n[b]Hraj přes 350 úrovní[\/b] a zažij rozmanitou hratelnost s širokou škálou předmětů, bloků a nebezpečí. Některé předměty mohou změnit gravitaci a rychlost hráče, což umožňuje vyšší skoky, teleportaci a mnoho dalšího!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Editor úrovní umožňuje vytvářet vlastní úrovně s více než 110 bloky a předměty![\/b] Klíčové funkce editoru úrovní zahrnují ukládání\/načítání více úrovní, aktivaci mlhy, změnu hudby, přidávání narativních textů a přepínání mezi herním a stavebním režimem. Vytvoř nekonečnou zábavu s miliony kombinací úrovní! Nakonec můžeš své úrovně publikovat na Steam Workshopu!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Lokální multiplayer umožňuje hrát s 2, 3 nebo 4 hráči![\/b] Všichni hráči si mohou přizpůsobit svůj vzhled pomocí odemykatelných skinů a klobouků a změnit ovládání se čtyřmi přednastavenými možnostmi. V současné době má lokální multiplayer dva herní režimy: [b]Přežití[\/b] a [b]Závod[\/b], s plány na přidání dalších. Všechny herní režimy podporují všechny hráče.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Pokud chceš běžet nekonečnými ručně vytvořenými úrovněmi, vyzkoušej tento herní režim![\/b] Nekonečný běh má tři varianty: normální režim, klasický režim a přizpůsobitelný nekonečný běh.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nMůžeš přizpůsobit svou postavu skiny a klobouky. Skins lze odemknout plněním různých úkolů a většina klobouků je k zakoupení v obchodě s klobouky!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature je open source[\/b], což usnadňuje úpravu kódu a vylepšení hry.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]A ve hře je ještě mnohem více![\/b] Doufáme, že přidáme další funkce a doufáme, že se ti naše hra bude líbit!\r\n\r\n[h2][b]Je tato hra pro tebe?[\/b][\/h2]\r\nPokud máš rád náročné plošinovky s kouskem puzzle, rád vytváříš vlastní úrovně, soutěžíš na žebříčcích a provádíš speedruny, pak je tato hra pro tebe!","app[content][short_description]":"The Colorful Creature je náročná plošinovka s barevnými puzzle mechanikami. Zažij přes 300 úrovní s širokou škálou předmětů a nebezpečí, vestavěný editor úrovní, lokální multiplayer, nekonečný běh, přizpůsobitelné skiny a klobouky, Steam Workshop a mnoho dalšího.","app[content][sysreqs][mac][min][osversion]":"Pořiďte si Windows VM, uživatelé Apple","app[content][sysreqs][mac][min][processor]":"Pravděpodobně máte procesor Intel","app[content][sysreqs][mac][min][graphics]":"Neznámé","app[content][sysreqs][mac][min][notes]":"Jesse, potřebujeme VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Ještě někdo používá toto???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Ještě někdo používá toto???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Verze 1.1[\/h2]\r\n- Opravený postup a úspěchy na Steamu\r\n- Vylepšená podpora ovladačů\r\n\r\n- Děkujeme za vaši stálou podporu!","app[content][sections][2][content]":"Úžasné uživatelské úrovně!","app[content][sections][3][label]":"Obchod!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"danish":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature er et udfordrende platformspil med farverige puslespilsmekanikker.[\/h2]\r\n\r\n[b]Spil gennem mere end 350 niveauer[\/b] og oplev en forskelligartet gameplay med et stort udvalg af genstande, blokke og farer. Nogle genstande kan ændre tyngdekraften og spillerens hastighed, hvilket giver dig mulighed for at hoppe højere, teleportere fra sted til sted og meget mere!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Level editoren giver dig mulighed for at oprette dine egne niveauer med over 110 blokke og genstande![\/b] De vigtigste funktioner i level editoren inkluderer at gemme\/indlæse flere niveauer, aktivere tåge, ændre musik, tilføje fortællende tekster og skifte mellem spil-\/bygningsfunktioner. Skab uendelig sjov med millioner af niveaukombinationer! Endelig kan du udgive dine niveauer på Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Lokal multiplayer-tilstand giver dig mulighed for at spille med 2, 3 eller 4 spillere![\/b] Alle spillere kan tilpasse deres udseende med oplåste skins og hatte samt ændre kontrollerne med fire forudindstillinger. I øjeblikket har lokal multiplayer-tilstand to spiltilstande: [b]Overlevelse[\/b] og [b]Løb[\/b], og vi planlægger at tilføje flere. Alle spiltilstande understøtter alle spillere.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Hvis du vil løbe gennem uendelige håndlavede niveauer, så prøv denne spiltilstand![\/b] Endless Run-tilstand har tre variationer: normal tilstand, klassisk tilstand og tilpasselig Endless Run-tilstand.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nDu kan tilpasse din karakter med skins og hatte. Skins kan låses op ved at gennemføre forskellige opgaver, og de fleste hatte kan købes i hattebutikken!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature er open source[\/b], hvilket gør det nemmere end nogensinde at modificere koden og forbedre spillet.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Og der er meget mere i spillet![\/b] Vi håber at tilføje flere funktioner og håber, du nyder vores spil!\r\n\r\n[h2][b]Er dette spil for dig?[\/b][\/h2]\r\nHvis du kan lide udfordrende platformspil med et strejf af puslespil, kan lide at skabe dine egne niveauer, konkurrere på ledertavler og lave speedruns, så er dette spil for dig!","app[content][short_description]":"The Colorful Creature er et udfordrende platformspil med farverige puslespilsmekanikker. Oplev over 300 niveauer med et stort udvalg af genstande og farer, indbygget level editor, lokal multiplayer, uendelige løb, tilpasningsbare skins og hatte, Steam Workshop og meget mere.","app[content][sysreqs][mac][min][osversion]":"Få en Windows VM, Apple-brugere","app[content][sysreqs][mac][min][processor]":"Du har sandsynligvis en Intel-processor","app[content][sysreqs][mac][min][graphics]":"Ukendt","app[content][sysreqs][mac][min][notes]":"Jesse, vi har brug for en VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Bruger nogen stadig dette???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Bruger nogen stadig dette???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Version 1.1[\/h2]\r\n- Rettet fremskridt og præstationer på Steam\r\n- Forbedret controller-support\r\n\r\n- Tak for jeres fortsatte støtte!","app[content][sections][2][content]":"Fantastiske brugeroprettede niveauer!","app[content][sections][3][label]":"Butik!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"dutch":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature is een uitdagende platformgame met kleurrijke puzzelmechanieken.[\/h2]\r\n\r\n[b]Speel door meer dan 350 levels[\/b] en ervaar een gevarieerde gameplay met een breed scala aan voorwerpen, blokken en gevaren. Sommige voorwerpen kunnen de zwaartekracht en snelheid van de speler veranderen, waardoor je hoger kunt springen, van plaats naar plaats kunt teleporteren en nog veel meer!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]De level editor stelt je in staat je eigen levels te maken met meer dan 110 blokken en voorwerpen![\/b] De belangrijkste functies van de level editor zijn het opslaan\/laden van meerdere levels, het activeren van mist, het veranderen van muziek, het toevoegen van verhalende teksten en het schakelen tussen spel- en bouwmodi. Creëer eindeloos plezier met miljoenen levelcombinaties! Tot slot kun je je levels publiceren op de Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]De lokale multiplayer-modus stelt je in staat te spelen met 2, 3 of 4 spelers![\/b] Alle spelers kunnen hun uiterlijk aanpassen met ontgrendelde skins en hoeden, en de besturing wijzigen met vier presets. Momenteel heeft de lokale multiplayer-modus twee spelmodi: [b]Overleven[\/b] en [b]Race[\/b], met plannen om meer toe te voegen. Alle spelmodi ondersteunen alle spelers.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Als je door handgemaakte eindeloze levels wilt rennen, probeer dan deze spelmodus![\/b] De Eindeloze Ren-modus heeft drie varianten: normale modus, klassieke modus en aanpasbare Eindeloze Ren-modus.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nJe kunt je personage aanpassen met skins en hoeden. Skins kunnen worden ontgrendeld door verschillende taken te voltooien, en de meeste hoeden kunnen worden gekocht in de hoedenwinkel!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature is open source[\/b], waardoor het gemakkelijker dan ooit is om de code te wijzigen en het spel te verbeteren.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]En er is nog veel meer in het spel![\/b] We hopen meer functies toe te voegen en hopen dat je van ons spel geniet!\r\n\r\n[h2][b]Is dit spel iets voor jou?[\/b][\/h2]\r\nAls je van uitdagende platformgames met een vleugje puzzel houdt, graag je eigen levels maakt, concurreert op ranglijsten en speedruns doet, dan is dit spel iets voor jou!","app[content][short_description]":"The Colorful Creature is een uitdagende platformgame met kleurrijke puzzelmechanieken. Ervaar meer dan 300 levels met een breed scala aan voorwerpen en gevaren, ingebouwde level editor, lokale multiplayer, eindeloze rennen, aanpasbare skins en hoeden, Steam Workshop en meer.","app[content][sysreqs][mac][min][osversion]":"Verkrijg een Windows VM, Apple-gebruikers","app[content][sysreqs][mac][min][processor]":"Je hebt waarschijnlijk een Intel-processor","app[content][sysreqs][mac][min][graphics]":"Onbekend","app[content][sysreqs][mac][min][notes]":"Jesse, we hebben een VM nodig, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Gebruikt iemand dit nog???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Gebruikt iemand dit nog???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versie 1.1[\/h2]\r\n- Voortgang en prestaties op Steam gerepareerd\r\n- Verbeterde controller-ondersteuning\r\n\r\n- Bedankt voor jullie voortdurende steun!","app[content][sections][2][content]":"Geweldige door gebruikers gemaakte levels!","app[content][sections][3][label]":"Winkel!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"finnish":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature on haastava tasohyppelypeli, jossa on värikkäitä pulmapelimekaniikkoja.[\/h2]\r\n\r\n[b]Pelaa yli 350 tasoa[\/b] ja koe monipuolinen pelattavuus, jossa on laaja valikoima esineitä, blokkeja ja vaaroja. Jotkin esineet voivat muuttaa painovoimaa ja pelaajan nopeutta, mikä mahdollistaa korkeammat hypyt, teleporttaamisen ja paljon muuta!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Tasoeditori mahdollistaa omien tasojen luomisen yli 110 blokilla ja esineellä![\/b] Tasoeditorin tärkeimpiä ominaisuuksia ovat useiden tasojen tallentaminen\/lataaminen, sumun aktivoiminen, musiikin muuttaminen, kerronnallisten tekstien lisääminen ja siirtyminen peli-\/rakennustilojen välillä. Luo loputonta hauskuutta miljoonilla tasoyhdistelmillä! Lopuksi voit julkaista tason Steam Workshopissa!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Paikallinen moninpeli mahdollistaa pelaamisen 2, 3 tai 4 pelaajalla![\/b] Kaikki pelaajat voivat mukauttaa ulkonäköään avattavilla nahoilla ja hatuilla sekä muuttaa ohjaimia neljällä esiasetuksella. Tällä hetkellä paikallisessa moninpelissä on kaksi pelitilaa: [b]Selviytyminen[\/b] ja [b]Kilpa[\/b], ja suunnittelemme lisää. Kaikki pelitilat tukevat kaikkia pelaajia.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Jos haluat juosta loputtomien käsintehtyjen tasojen läpi, kokeile tätä pelitilaa![\/b] Loputtomassa juoksussa on kolme variaatiota: normaali tila, klassinen tila ja muokattava loputon juoksutila.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nVoit mukauttaa hahmosi nahkoilla ja hatuilla. Nahkoja voidaan avata suorittamalla erilaisia tehtäviä, ja useimmat hatut voidaan ostaa hattukaupasta!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature on avoimen lähdekoodin[\/b], mikä tekee koodin muokkaamisesta ja pelin parantamisesta helpompaa kuin koskaan.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Ja pelissä on paljon muutakin![\/b] Toivomme lisäävämme lisää ominaisuuksia ja toivomme, että nautit pelistämme!\r\n\r\n[h2][b]Onko tämä peli sinulle?[\/b][\/h2]\r\nJos pidät haastavista tasohyppelypeleistä, joissa on ripaus pulmia, tykkäät luoda omia tasoja, kilpailla tulostauluilla ja tehdä speedrunneja, tämä peli on sinulle!","app[content][short_description]":"The Colorful Creature on haastava tasohyppelypeli, jossa on värikkäitä pulmapelimekaniikkoja. Koe yli 300 tasoa, joissa on laaja valikoima esineitä ja vaaroja, sisäänrakennettu tasoeditori, paikallinen moninpeli, loputon juoksutila, mukautettavat nahat ja hatut, Steam Workshop ja paljon muuta.","app[content][sysreqs][mac][min][osversion]":"Hanki Windows VM, Apple-käyttäjät","app[content][sysreqs][mac][min][processor]":"Sinulla on todennäköisesti Intel-prosessori","app[content][sysreqs][mac][min][graphics]":"Tuntematon","app[content][sysreqs][mac][min][notes]":"Jesse, tarvitsemme VM:n, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Käyttääkö joku tätä vielä???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Käyttääkö joku tätä vielä???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versio 1.1[\/h2]\r\n- Edistyksen ja saavutusten korjaus Steamissä\r\n- Parannettu ohjaintuki\r\n\r\n- Kiitos jatkuvasta tuestanne!","app[content][sections][2][content]":"Mahtavia käyttäjien luomia tasoja!","app[content][sections][3][label]":"Kauppa!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"greek":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature είναι ένα απαιτητικό παιχνίδι πλατφόρμας με πολύχρωμους μηχανισμούς παζλ.[\/h2]\r\n\r\n[b]Παίξτε σε πάνω από 350 επίπεδα[\/b] και απολαύστε ποικιλία στο gameplay με διάφορα αντικείμενα, μπλοκ και κινδύνους. Μερικά αντικείμενα μπορούν να αλλάξουν τη βαρύτητα και την ταχύτητα του παίκτη, επιτρέποντας ψηλότερα άλματα, τηλεμεταφορά και πολλά άλλα!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Ο επεξεργαστής επιπέδων σας επιτρέπει να δημιουργείτε τα δικά σας επίπεδα με πάνω από 110 μπλοκ και αντικείμενα![\/b] Οι κύριες λειτουργίες του επεξεργαστή επιπέδων περιλαμβάνουν αποθήκευση\/φόρτωση πολλαπλών επιπέδων, ενεργοποίηση ομίχλης, αλλαγή μουσικής, προσθήκη κειμένων αφήγησης και εναλλαγή μεταξύ λειτουργίας παιχνιδιού και λειτουργίας κατασκευής. Δημιουργήστε ατελείωτη διασκέδαση με εκατομμύρια συνδυασμούς επιπέδων! Τέλος, μπορείτε να δημοσιεύσετε τα επίπεδά σας στο Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Το τοπικό multiplayer σας επιτρέπει να παίξετε με 2, 3 ή 4 παίκτες![\/b] Κάθε παίκτης μπορεί να προσαρμόσει την εμφάνισή του με skins και καπέλα που ξεκλειδώνονται και μπορεί να αλλάξει τους ελέγχους με τέσσερις προκαθορισμένες επιλογές. Επί του παρόντος, το τοπικό multiplayer έχει δύο λειτουργίες παιχνιδιού: [b]Επιβίωση[\/b] και [b]Αγώνας[\/b], με σχέδια για προσθήκη περισσότερων λειτουργιών. Όλες οι λειτουργίες παιχνιδιού υποστηρίζουν όλους τους παίκτες.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Αν θέλετε να τρέξετε σε χειροποίητα ατελείωτα επίπεδα, δοκιμάστε αυτή τη λειτουργία παιχνιδιού![\/b] Η λειτουργία ατελείωτου τρεξίματος έχει τρεις παραλλαγές: κανονική λειτουργία, κλασική λειτουργία και προσαρμόσιμη ατελείωτη λειτουργία τρεξίματος.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nΜπορείτε να προσαρμόσετε τον χαρακτήρα σας με skins και καπέλα. Τα skins μπορούν να ξεκλειδωθούν ολοκληρώνοντας διάφορες αποστολές, και τα περισσότερα καπέλα μπορούν να αγοραστούν από το κατάστημα καπέλων!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature είναι ανοιχτού κώδικα[\/b], που καθιστά ακόμα πιο εύκολη την τροποποίηση του κώδικα και τη βελτίωση του παιχνιδιού.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Και πολλά περισσότερα στο παιχνίδι![\/b] Ελπίζουμε να προσθέσουμε περισσότερες δυνατότητες και ελπίζουμε να απολαύσετε το παιχνίδι μας!\r\n\r\n[h2][b]Είναι αυτό το παιχνίδι για εσάς;[\/b][\/h2]\r\nΑν σας αρέσουν τα απαιτητικά παιχνίδια πλατφόρμας με παζλ στοιχεία, αν σας αρέσει να δημιουργείτε τα δικά σας επίπεδα, να ανταγωνίζεστε στις κατατάξεις και να κάνετε speedruns, τότε αυτό το παιχνίδι είναι για εσάς!","app[content][short_description]":"The Colorful Creature είναι ένα απαιτητικό παιχνίδι πλατφόρμας με πολύχρωμους μηχανισμούς παζλ. Απολαύστε πάνω από 300 επίπεδα με ποικιλία αντικειμένων και κινδύνων, ενσωματωμένο επεξεργαστή επιπέδων, τοπικό multiplayer, ατελείωτο τρέξιμο, προσαρμόσιμα skins και καπέλα, Steam Workshop και πολλά άλλα.","app[content][sysreqs][mac][min][osversion]":"Πάρτε ένα Windows VM, χρήστες Apple","app[content][sysreqs][mac][min][processor]":"Πιθανότατα έχετε επεξεργαστή Intel","app[content][sysreqs][mac][min][graphics]":"Άγνωστο","app[content][sysreqs][mac][min][notes]":"Τζέσι, χρειαζόμαστε ένα VM, Τζέσι","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (χαχα)","app[content][sysreqs][windows][min][soundcard]":"Κάποιος το χρησιμοποιεί ακόμα αυτό;;;","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (χαχα)","app[content][sysreqs][linux][min][soundcard]":"Κάποιος το χρησιμοποιεί ακόμα αυτό;;;","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Έκδοση 1.1[\/h2]\r\n- Βελτίωση της προόδου και των επιτευγμάτων στο Steam\r\n- Βελτιωμένη υποστήριξη χειριστηρίων\r\n\r\n- Ευχαριστούμε για τη συνεχή υποστήριξη!","app[content][sections][2][content]":"Καταπληκτικά επίπεδα από χρήστες!","app[content][sections][3][label]":"Κατάστημα!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"hungarian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]A The Colorful Creature egy kihívásokkal teli platformjáték színes rejtvénymechanikával.[\/h2]\r\n\r\n[b]Játssz több mint 350 szinten[\/b] és élvezd a változatos játékmenetet különféle tárgyakkal, blokkokkal és veszélyekkel. Néhány tárgy megváltoztathatja a játékos gravitációját és sebességét, lehetővé téve a magasabb ugrásokat, teleportálást és még sok mást!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]A pályaszerkesztő lehetővé teszi saját szintek létrehozását több mint 110 blokkal és tárggyal![\/b] A pályaszerkesztő fő funkciói közé tartozik több szint mentése\/betöltése, köd aktiválása, zene változtatása, narratív szövegek hozzáadása és a játékmód és az építési mód közötti váltás. Készíts végtelen szórakozást milliónyi szintkombinációval! Végül közzéteheted szintjeidet a Steam Workshop-on!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]A helyi többjátékos mód lehetővé teszi, hogy 2, 3 vagy 4 játékossal játszhass![\/b] Minden játékos testreszabhatja megjelenését feloldható skinekkel és kalapokkal, és módosíthatja a vezérlőket négy előre beállított opcióval. Jelenleg a helyi többjátékos módnak két játékmódja van: [b]Túlélés[\/b] és [b]Verseny[\/b], és továbbiak hozzáadását tervezik. Minden játékmód támogatja az összes játékost.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Ha szeretnél végtelen kézzel készített szinteken át szaladni, próbáld ki ezt a játékmódot![\/b] A végtelen futás játékmódnak három változata van: normál mód, klasszikus mód és testreszabható végtelen futás mód.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nA karakteredet testreszabhatod skinekkel és kalapokkal. A skineket különböző feladatok teljesítésével lehet feloldani, és a legtöbb kalapot meg lehet vásárolni a kalapboltban!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]A The Colorful Creature nyílt forráskódú[\/b], ami még könnyebbé teszi a kód módosítását és a játék javítását.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]És még sok minden más van a játékban![\/b] Reméljük, hogy több funkciót is hozzáadunk, és reméljük, hogy élvezni fogod a játékunkat!\r\n\r\n[h2][b]Neked való ez a játék?[\/b][\/h2]\r\nHa szereted a kihívásokkal teli platformjátékokat egy kis rejtvénnyel, szereted saját szinteket készíteni, versenyezni a ranglistákon és gyorsasági futásokat végezni, akkor ez a játék neked való!","app[content][short_description]":"A The Colorful Creature egy kihívásokkal teli platformjáték színes rejtvénymechanikával. Élvezd több mint 300 szintet különféle tárgyakkal és veszélyekkel, beépített pályaszerkesztővel, helyi többjátékos móddal, végtelen futással, testreszabható skinekkel és kalapokkal, Steam Workshop-pal és még sok mással.","app[content][sysreqs][mac][min][osversion]":"Szerezz be egy Windows VM-et, Apple felhasználók","app[content][sysreqs][mac][min][processor]":"Valószínűleg van egy Intel processzorod","app[content][sysreqs][mac][min][graphics]":"Ismeretlen","app[content][sysreqs][mac][min][notes]":"Jesse, szükségünk van egy VM-re, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Valaki még mindig használja ezt???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Valaki még mindig használja ezt???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]1.1 verzió[\/h2]\r\n- Előrehaladás és teljesítmények javítása a Steamen\r\n- Javított vezérlőtámogatás\r\n\r\n- Köszönjük a folyamatos támogatást!","app[content][sections][2][content]":"Fantasztikus felhasználó által készített szintek!","app[content][sections][3][label]":"Bolt!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"indonesian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature adalah permainan platform yang menantang dengan mekanika teka-teki yang penuh warna.[\/h2]\r\n\r\n[b]Mainkan lebih dari 350 level[\/b] dan nikmati gameplay yang beragam dengan berbagai objek, blok, dan bahaya. Beberapa objek dapat mengubah gravitasi dan kecepatan pemain, memungkinkan lompatan lebih tinggi, teleportasi, dan banyak lagi!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Editor level memungkinkan Anda membuat level Anda sendiri dengan lebih dari 110 blok dan objek![\/b] Fungsi utama editor level termasuk menyimpan\/memuat beberapa level, mengaktifkan kabut, mengubah musik, menambahkan teks naratif, dan beralih antara mode permainan dan mode konstruksi. Ciptakan kesenangan tanpa akhir dengan jutaan kombinasi level! Terakhir, Anda dapat mempublikasikan level Anda di Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Mode multipemain lokal memungkinkan Anda bermain dengan 2, 3, atau 4 pemain![\/b] Setiap pemain dapat menyesuaikan penampilan mereka dengan skin dan topi yang dapat dibuka dan dapat mengubah kontrol dengan empat opsi yang telah ditentukan sebelumnya. Saat ini, mode multipemain lokal memiliki dua mode permainan: [b]Bertahan Hidup[\/b] dan [b]Balapan[\/b], dengan rencana untuk menambahkan lebih banyak mode. Semua mode permainan mendukung semua pemain.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Jika Anda ingin berlari di level tak terbatas yang dibuat secara manual, cobalah mode permainan ini![\/b] Mode lari tak terbatas memiliki tiga variasi: mode normal, mode klasik, dan lari tak terbatas yang dapat disesuaikan.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nAnda dapat menyesuaikan karakter Anda dengan skin dan topi. Skin dapat dibuka dengan menyelesaikan berbagai misi dan sebagian besar topi dapat dibeli dari toko topi!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature adalah open source[\/b], yang memudahkan modifikasi kode dan peningkatan permainan.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Dan banyak lagi dalam permainan![\/b] Kami berharap dapat menambahkan lebih banyak fitur dan berharap Anda menikmati permainan kami!\r\n\r\n[h2][b]Apakah permainan ini cocok untuk Anda?[\/b][\/h2]\r\nJika Anda menyukai permainan platform yang menantang dengan elemen teka-teki, jika Anda suka membuat level Anda sendiri, bersaing di papan peringkat, dan melakukan speedrun, maka permainan ini cocok untuk Anda!","app[content][short_description]":"The Colorful Creature adalah permainan platform yang menantang dengan mekanika teka-teki yang penuh warna. Nikmati lebih dari 300 level dengan berbagai objek dan bahaya, editor level terintegrasi, multipemain lokal, lari tak terbatas, skin dan topi yang dapat disesuaikan, Steam Workshop, dan banyak lagi.","app[content][sysreqs][mac][min][osversion]":"Dapatkan VM Windows, pengguna Apple","app[content][sysreqs][mac][min][processor]":"Anda mungkin memiliki prosesor Intel","app[content][sysreqs][mac][min][graphics]":"Tidak diketahui","app[content][sysreqs][mac][min][notes]":"Jessie, kami membutuhkan VM, Jessie","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Apakah ada yang masih menggunakan ini???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Apakah ada yang masih menggunakan ini???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versi 1.1[\/h2]\r\n- Peningkatan kemajuan dan pencapaian di Steam\r\n- Peningkatan dukungan pengontrol\r\n\r\n- Terima kasih atas dukungan Anda yang berkelanjutan!","app[content][sections][2][content]":"Level menakjubkan yang dibuat oleh pengguna!","app[content][sections][3][label]":"Toko!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"japanese":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature は色のパズルメカニクスを持つ挑戦的なプラットフォーマーゲームです。[\/h2]\r\n\r\n[b]350以上のレベルをプレイ[\/b]して、多種多様なゲームプレイを体験しましょう。多数のアイテム、ブロック、および危険が待ち受けています。いくつかのアイテムはプレイヤーの重力とスピードを変えることができ、より高くジャンプしたり、場所から場所へテレポートしたり、さらに多くのことができます！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]レベルエディタを使用して、110以上のブロックとアイテムを使って自分のレベルを作成できます！[\/b] レベルエディタの主要な機能には、複数のレベルを保存\/ロードする機能、フォグを有効にする機能、音楽を変更する機能、ナレーションテキストを追加する機能、そしてゲームモード\/ビルドモードを切り替える機能があります。数百万通りの異なるレベルの組み合わせが無限の楽しみを提供します！ 最後に、Steamワークショップにレベルを公開することができます！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]ローカルマルチプレイヤーモードで、2人、3人、または4人のプレイヤーと一緒にプレイできます！[\/b] すべてのプレイヤーは、解除されたスキンと帽子を使用して外観をカスタマイズでき、4つのプリセットを使用してコントロールを変更できます。現在、ローカルマルチプレイヤーモードには、[b]サバイバル[\/b] と [b]レース[\/b] の2つのゲームモードがあり、今後さらに追加予定です。すべてのゲームモードは、すべてのプレイヤーに対応しています。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]手作りの無限のレベルを駆け抜けたい場合は、このゲームモードを試してください！[\/b] エンドレスランモードには、ノーマルモード、オールドスクールモード、カスタマイズ可能なエンドレスランの3つのバリエーションがあります。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nスキンと帽子を使用してキャラクターをカスタマイズできます。スキンはさまざまなタスクを完了することで解除され、ほとんどの帽子は帽子ショップで購入できます！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature はオープンソースです[\/b] これにより、コードの変更やゲームの改善がこれまでになく簡単になります。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]そしてさらに多くの内容があります！[\/b] 私たちは、さらなる機能の追加を計画しており、皆さんがこのゲームを楽しんでいただけることを願っています！\r\n\r\n[h2][b]このゲームはあなたに合っていますか？[\/b][\/h2]\r\n挑戦的なプラットフォーマーが好きな方、少しのパズルが好きな方、自分のレベルを作成するのが好きな方、リーダーボードで競争するのが好きな方、そしてスピードランが好きな方には、このゲームがピッタリです！","app[content][short_description]":"The Colorful Creature は色のパズルメカニクスを持つ挑戦的なプラットフォーマーゲームです。多種多様なアイテムと危険がある300以上のレベル、内蔵のレベルエディタ、ローカルマルチプレイヤーモード、無限ラン、カスタマイズ可能なスキンと帽子、Steamワークショップなどを体験してください。","app[content][sysreqs][mac][min][osversion]":"AppleユーザーにはWindows VMを入手してください","app[content][sysreqs][mac][min][processor]":"おそらくIntelプロセッサーがあります","app[content][sysreqs][mac][min][graphics]":"分からない","app[content][sysreqs][mac][min][notes]":"ジェシー、VMが必要だ、ジェシー","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (ハハハ)","app[content][sysreqs][windows][min][soundcard]":"誰がこれを使ってるの???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (ハハハ)","app[content][sysreqs][linux][min][soundcard]":"誰がこれを使ってるの???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]バージョン 1.1[\/h2]\r\n- Steamの進行状況と実績を修正\r\n- コントローラーのサポートを改善\r\n\r\n- あなたの継続的なサポートに感謝します！","app[content][sections][2][content]":"驚異的なユーザー作成レベル！","app[content][sections][3][label]":"ショップ！","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"koreana":{"app[content][about]":"","app[content][short_description]":"","app[content][sysreqs][mac][min][osversion]":"","app[content][sysreqs][mac][min][processor]":"","app[content][sysreqs][mac][min][graphics]":"","app[content][sysreqs][mac][min][notes]":"","app[content][sysreqs][windows][min][osversion]":"","app[content][sysreqs][windows][min][processor]":"","app[content][sysreqs][windows][min][graphics]":"","app[content][sysreqs][windows][min][soundcard]":"","app[content][sysreqs][linux][min][osversion]":"","app[content][sysreqs][linux][min][processor]":"","app[content][sysreqs][linux][min][graphics]":"","app[content][sysreqs][linux][min][soundcard]":"","app[content][sections][0][label]":"","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"","app[content][sections][2][content]":"","app[content][sections][3][label]":"","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"norwegian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature er et utfordrende plattformspill med fargerike puslespillmekanikker.[\/h2]\r\n\r\n[b]Spill gjennom over 350 nivåer[\/b] og opplev variert gameplay med et bredt utvalg av gjenstander, blokker og farer. Noen gjenstander kan endre spillerens tyngdekraft og hastighet, noe som muliggjør høyere hopp, teleportering og mye mer!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Nivåredigereren lar deg lage egne nivåer med over 110 blokker og gjenstander![\/b] Viktige funksjoner i nivåredigereren inkluderer å lagre\/lese inn flere nivåer, aktivere tåke, endre musikk, legge til fortellende tekster og veksle mellom spill- og byggemodus. Lag uendelig moro med millioner av nivåkombinasjoner! Til slutt kan du publisere nivåene dine på Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Lokal flerspiller lar deg spille med 2, 3 eller 4 spillere![\/b] Alle spillere kan tilpasse sitt utseende med opplåsbare skins og hatter, og endre kontrollene med fire forhåndsinnstillinger. For øyeblikket har lokal flerspiller to spillmoduser: [b]Overlevelse[\/b] og [b]Race[\/b], med planer om å legge til flere. Alle spillmoduser støtter alle spillere.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Hvis du vil løpe gjennom endeløse håndlagde nivåer, prøv denne spillmodusen![\/b] Endeløs løp-modus har tre varianter: normal modus, klassisk modus og tilpassbar endeløs løp-modus.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nDu kan tilpasse karakteren din med skins og hatter. Skins kan låses opp ved å fullføre forskjellige oppgaver, og de fleste hatter kan kjøpes i hattbutikken!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature er åpen kildekode[\/b], noe som gjør det lettere enn noen gang å endre koden og forbedre spillet.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Og det er mye mer i spillet![\/b] Vi håper å legge til flere funksjoner og håper du liker spillet vårt!\r\n\r\n[h2][b]Er dette spillet for deg?[\/b][\/h2]\r\nHvis du liker utfordrende plattformspill med en touch av puslespill, liker å lage egne nivåer, konkurrere på topplister og gjøre speedruns, er dette spillet for deg!","app[content][short_description]":"The Colorful Creature er et utfordrende plattformspill med fargerike puslespillmekanikker. Opplev over 300 nivåer med et bredt utvalg av gjenstander og farer, innebygd nivåredigerer, lokal flerspiller, endeløs løp-modus, tilpassbare skins og hatter, Steam Workshop og mer.","app[content][sysreqs][mac][min][osversion]":"Skaff en Windows VM, Apple-brukere","app[content][sysreqs][mac][min][processor]":"Du har sannsynligvis en Intel-prosessor","app[content][sysreqs][mac][min][graphics]":"Ukjent","app[content][sysreqs][mac][min][notes]":"Jesse, vi trenger en VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Bruker noen dette fortsatt???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Bruker noen dette fortsatt???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versjon 1.1[\/h2]\r\n- Fikset fremgang og prestasjoner på Steam\r\n- Forbedret kontrollstøtte\r\n\r\n- Takk for deres fortsatte støtte!","app[content][sections][2][content]":"Fantastiske brukerskapte nivåer!","app[content][sections][3][label]":"Butikk!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"polish":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature to wymagająca platformówka z mechaniką kolorowych zagadek.[\/h2]\r\n\r\n[b]Graj w ponad 350 poziomów[\/b] i doświadczaj różnorodnej rozgrywki z mnóstwem przedmiotów, bloków i niebezpieczeństw. Niektóre przedmioty mogą zmieniać grawitację i prędkość gracza, pozwalając ci skakać wyżej, teleportować się z miejsca na miejsce i wiele więcej!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Edytor poziomów pozwala tworzyć własne poziomy z ponad 110 blokami i przedmiotami![\/b] Główne funkcje edytora poziomów to zapisywanie\/ładowanie wielu poziomów, włączanie mgły, zmienianie muzyki, dodawanie tekstów narracyjnych oraz przełączanie między trybami gry\/budowy. Twórz nieskończoną zabawę z milionami kombinacji poziomów! Na koniec, możesz publikować swoje poziomy w Warsztacie Steam!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Tryb lokalnej gry wieloosobowej pozwala grać z 2, 3 lub 4 graczami![\/b] Wszyscy gracze mogą dostosować swój wygląd za pomocą odblokowanych skórek i kapeluszy oraz zmieniać sterowanie za pomocą czterech ustawień wstępnych. Obecnie tryb lokalnej gry wieloosobowej oferuje dwa tryby gry: [b]Przetrwanie[\/b] i [b]Wyścig[\/b], z planami na dodanie kolejnych. Wszystkie tryby gry obsługują wszystkich graczy.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Jeśli chcesz biegać po ręcznie tworzonych nieskończonych poziomach, spróbuj tego trybu gry![\/b] Tryb Nieskończonego Biegu ma trzy warianty: tryb normalny, tryb klasyczny i dostosowywalny tryb Nieskończonego Biegu.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nMożesz dostosować swoją postać za pomocą skórek i kapeluszy. Skórki można odblokować, wykonując różne zadania, a większość kapeluszy można kupić w sklepie z kapeluszami!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature jest projektem open source[\/b], co ułatwia jak nigdy dotąd modyfikowanie kodu i ulepszanie gry. \r\n\r\n\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]I jest jeszcze więcej w grze![\/b] Mamy nadzieję dodać więcej funkcji i mamy nadzieję, że spodoba ci się nasza gra!\r\n\r\n[h2][b]Czy ta gra jest dla ciebie?[\/b][\/h2]\r\nJeśli lubisz wymagające platformówki z elementami zagadek, lubisz tworzyć własne poziomy, rywalizować na tablicach wyników i robić speedruny, to ta gra jest dla ciebie!","app[content][short_description]":"The Colorful Creature to wymagająca platformówka z mechaniką kolorowych zagadek. Graj w ponad 300 poziomów z różnorodnymi przedmiotami i niebezpieczeństwami, korzystaj z wbudowanego edytora poziomów, trybu lokalnej gry wieloosobowej, nieskończonych biegów, dostosowywanych skórek i kapeluszy, Warsztatu Steam i nie tylko.","app[content][sysreqs][mac][min][osversion]":"Zdobądź VM z Windows, użytkownicy Apple","app[content][sysreqs][mac][min][processor]":"Prawdopodobnie masz procesor Intel","app[content][sysreqs][mac][min][graphics]":"Nieznane","app[content][sysreqs][mac][min][notes]":"Jesse, potrzebujemy VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Czy ktoś tego używa???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Czy ktoś tego używa???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Wersja 1.1[\/h2]\r\n- Naprawiono postępy i osiągnięcia na Steam\r\n- Ulepszono wsparcie dla kontrolerów\r\n\r\n- Dziękujemy za wasze ciągłe wsparcie!","app[content][sections][2][content]":"Niesamowite poziomy tworzone przez użytkowników!","app[content][sections][3][label]":"Sklep!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"brazilian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature é um jogo de plataforma desafiador com mecânicas de quebra-cabeça coloridas.[\/h2]\r\n\r\n[b]Jogue em mais de 350 níveis[\/b] e aproveite uma jogabilidade diversificada com uma variedade de objetos, blocos e perigos. Alguns objetos podem mudar a gravidade e a velocidade do jogador, permitindo saltos mais altos, teletransporte e muito mais!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]O editor de níveis permite criar seus próprios níveis com mais de 110 blocos e objetos![\/b] As principais funções do editor de níveis incluem salvar\/carregar vários níveis, ativar neblina, mudar a música, adicionar textos narrativos e alternar entre o modo de jogo e o modo de construção. Crie diversão infinita com milhões de combinações de níveis! Por fim, você pode publicar seus níveis no Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]O multiplayer local permite jogar com 2, 3 ou 4 jogadores![\/b] Cada jogador pode personalizar sua aparência com skins e chapéus desbloqueáveis e pode alterar os controles com quatro opções predefinidas. Atualmente, o multiplayer local possui dois modos de jogo: [b]Sobrevivência[\/b] e [b]Corrida[\/b], com planos de adicionar mais modos. Todos os modos de jogo suportam todos os jogadores.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Se você deseja correr em níveis infinitos criados manualmente, experimente este modo de jogo![\/b] O modo de corrida infinita possui três variantes: modo normal, modo clássico e modo de corrida infinita personalizável.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nVocê pode personalizar seu personagem com skins e chapéus. As skins podem ser desbloqueadas completando várias tarefas, e a maioria dos chapéus pode ser adquirida na loja de chapéus!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature é de código aberto[\/b], o que facilita ainda mais a modificação do código e a melhoria do jogo.\r\n\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]E tem muito mais no jogo![\/b] Esperamos adicionar mais recursos e esperamos que você aproveite nosso jogo!\r\n\r\n[h2][b]Este jogo é para você?[\/b][\/h2]\r\nSe você gosta de jogos de plataforma desafiadores com um toque de quebra-cabeça, gosta de criar seus próprios níveis, competir nos rankings e fazer speedruns, então este jogo é para você!","app[content][short_description]":"The Colorful Creature é um jogo de plataforma desafiador com mecânicas de quebra-cabeça coloridas. Desfrute de mais de 300 níveis com uma variedade de objetos e perigos, editor de níveis integrado, multiplayer local, corrida infinita, skins e chapéus personalizáveis, Steam Workshop e muito mais.","app[content][sysreqs][mac][min][osversion]":"Obtenha uma VM Windows, usuários Apple","app[content][sysreqs][mac][min][processor]":"Provavelmente você tem um processador Intel","app[content][sysreqs][mac][min][graphics]":"Desconhecido","app[content][sysreqs][mac][min][notes]":"Jesse, precisamos de uma VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Alguém ainda usa isso???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Alguém ainda usa isso???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versão 1.1[\/h2]\r\n- Progresso e conquistas aprimoradas no Steam\r\n- Suporte aprimorado para controladores\r\n\r\n- Obrigado pelo apoio contínuo!","app[content][sections][2][content]":"Níveis incríveis criados pelos usuários!","app[content][sections][3][label]":"Loja!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"portuguese":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature é um jogo de plataforma desafiador com mecânicas de quebra-cabeça coloridas.[\/h2]\r\n\r\n[b]Jogue através de mais de 350 níveis[\/b] e experimente uma jogabilidade diversificada com uma grande variedade de itens, blocos e perigos. Alguns itens podem alterar a gravidade e a velocidade do jogador, permitindo que você pule mais alto, se teletransporte de um lugar para outro e muito mais!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]O editor de níveis permite que você crie seus próprios níveis com mais de 110 blocos e itens![\/b] As principais funcionalidades do editor de níveis incluem salvar\/carregar vários níveis, ativar neblina, alterar músicas, adicionar textos narrativos e alternar entre modos de jogo\/construção. Crie diversão infinita com milhões de combinações de níveis! Finalmente, você pode publicar seus níveis no Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]O modo multijogador local permite que você jogue com 2, 3 ou 4 jogadores![\/b] Todos os jogadores podem personalizar suas aparências com skins e chapéus desbloqueados, e alterar os controles com quatro predefinições. Atualmente, o modo multijogador local possui dois modos de jogo: [b]Sobrevivência[\/b] e [b]Corrida[\/b], e planejamos adicionar mais. Todos os modos de jogo suportam todos os jogadores.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Se você quer jogar níveis infinitos feitos à mão, experimente este modo de jogo![\/b] O modo Corrida Infinita possui três variações: modo normal, modo clássico e modo Corrida Infinita personalizável.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nVocê pode personalizar seu personagem com skins e chapéus. As skins podem ser desbloqueadas ao completar várias tarefas, e a maioria dos chapéus pode ser comprada na loja de chapéus!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature é de código aberto[\/b], facilitando mais do que nunca a modificação do código e a melhoria do jogo. \r\n\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]E há muito mais no jogo![\/b] Esperamos adicionar mais funcionalidades e esperamos que você goste do nosso jogo!\r\n\r\n[h2][b]Este jogo é para você?[\/b][\/h2]\r\nSe você gosta de jogos de plataforma desafiadores, com um pouco de quebra-cabeça, gosta de criar seus próprios níveis, competir em tabelas de classificação e fazer speedruns, então este é o jogo para você!","app[content][short_description]":"The Colorful Creature é um jogo de plataforma desafiador com mecânicas de quebra-cabeça coloridas. Experimente mais de 300 níveis com uma grande variedade de itens e perigos, editor de níveis integrado, modo multijogador local, corridas infinitas, skins e chapéus personalizáveis, Steam Workshop e muito mais.","app[content][sysreqs][mac][min][osversion]":"Obtenha uma VM do Windows, usuários Apple","app[content][sysreqs][mac][min][processor]":"Provavelmente você tem um processador Intel","app[content][sysreqs][mac][min][graphics]":"Desconhecido","app[content][sysreqs][mac][min][notes]":"Jesse, precisamos de uma VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Alguém ainda usa isso???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Alguém ainda usa isso???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versão 1.1[\/h2]\r\n- Corrigidos progresso e conquistas no Steam\r\n- Melhorado suporte a controladores\r\n\r\n- Obrigado pelo seu suporte contínuo!","app[content][sections][2][content]":"Níveis incríveis criados por usuários!","app[content][sections][3][label]":"Loja!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"romanian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature este un joc de platformă provocator cu mecanici de puzzle colorate.[\/h2]\r\n\r\n[b]Joacă-te pe mai mult de 350 de nivele[\/b] și bucură-te de gameplay divers cu o varietate de obiecte, blocuri și pericole. Unele obiecte pot schimba gravitația și viteza jucătorului, permițând sărituri mai înalte, teleportare și multe altele!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Editorul de nivele permite crearea propriilor nivele cu peste 110 blocuri și obiecte![\/b] Funcțiile cheie ale editorului de nivele includ salvarea\/încărcarea mai multor nivele, activarea ceții, schimbarea muzicii, adăugarea de texte narative și comutarea între modul de joc și modul de construcție. Creează distracție nesfârșită cu milioane de combinații de nivele! În final, poți publica nivelele tale pe Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Multiplayer local permite să joci cu 2, 3 sau 4 jucători![\/b] Fiecare jucător își poate personaliza aspectul cu skin-uri și pălării deblocate și poate modifica controalele cu patru opțiuni presetate. În prezent, multiplayer-ul local are două moduri de joc: [b]Supraviețuire[\/b] și [b]Cursă[\/b], cu planuri de adăugare a mai multor moduri. Toate modurile de joc suportă toți jucătorii.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Dacă vrei să alergi pe nivele infinite create manual, încearcă acest mod de joc![\/b] Modul de alergare infinită are trei variante: mod normal, mod clasic și mod de alergare infinită personalizabil.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nÎți poți personaliza personajul cu skin-uri și pălării. Skin-urile pot fi deblocate prin completarea diferitelor sarcini, iar majoritatea pălăriilor pot fi achiziționate din magazinul de pălării!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature este open source[\/b], ceea ce face și mai ușor modificarea codului și îmbunătățirea jocului. \r\n\r\n\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Și mai sunt multe alte lucruri în joc![\/b] Sperăm să adăugăm mai multe funcții și sperăm că vei savura jocul nostru!\r\n\r\n[h2][b]Este acest joc pentru tine?[\/b][\/h2]\r\nDacă îți plac jocurile de platformă provocatoare cu un strop de puzzle, îți place să creezi propriile nivele, să concurezi pe leaderboard-uri și să faci speedrun-uri, atunci acest joc este pentru tine!","app[content][short_description]":"The Colorful Creature este un joc de platformă provocator cu mecanici de puzzle colorate. Bucură-te de peste 300 de nivele cu o varietate de obiecte și pericole, editor de nivele integrat, multiplayer local, alergare infinită, skin-uri și pălării personalizabile, Steam Workshop și multe altele.","app[content][sysreqs][mac][min][osversion]":"Obține un VM Windows, utilizatori Apple","app[content][sysreqs][mac][min][processor]":"Probabil ai un procesor Intel","app[content][sysreqs][mac][min][graphics]":"Necunoscut","app[content][sysreqs][mac][min][notes]":"Jesse, avem nevoie de un VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Mai folosește cineva asta???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Mai folosește cineva asta???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versiunea 1.1[\/h2]\r\n- Progres și realizări îmbunătățite pe Steam\r\n- Suport pentru controlere îmbunătățit\r\n\r\n- Mulțumim pentru sprijinul continuu!","app[content][sections][2][content]":"Nivele uimitoare create de utilizatori!","app[content][sections][3][label]":"Magazin!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"russian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature — это сложная платформенная игра с механикой цветовых головоломок.[\/h2]\r\n\r\n[b]Играйте в более чем 350 уровней[\/b], предлагающих разнообразный игровой процесс с множеством предметов, блоков и опасностей. Некоторые предметы могут изменять гравитацию и скорость игрока, позволять прыгать выше, телепортироваться с места на место и многое другое!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Редактор уровней позволяет вам создавать свои собственные уровни с более чем 110 блоками и предметами![\/b] Основные функции редактора уровней включают сохранение\/загрузку нескольких уровней, включение тумана, изменение музыки, добавление текста повествования и переключение между режимами игры\/строительства. Миллионы различных комбинаций уровней обеспечат бесконечное удовольствие! Наконец, вы можете публиковать свои уровни в мастерской Steam!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Локальный многопользовательский режим позволяет играть с 2, 3 или 4 игроками![\/b] Все игроки могут настроить внешний вид с помощью разблокированных скинов и шляп, а также изменять управление с помощью четырех предустановок. В локальном многопользовательском режиме в настоящее время доступно два режима игры: [b]Выживание[\/b] и [b]Гонка[\/b], и мы планируем добавить больше. Все игровые режимы поддерживаются всеми игроками.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Если вы хотите пройти через вручную созданные бесконечные уровни, попробуйте этот игровой режим![\/b] В режиме бесконечного бега доступны три варианта: обычный режим, режим старой школы и настраиваемый бесконечный бег.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nВы можете настроить своего персонажа с помощью скинов и шляп. Скины разблокируются за выполнение различных задач, а большинство шляп можно приобрести в магазине шляп!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature с открытым исходным кодом[\/b], что делает изменение кода и дальнейшее улучшение игры проще, чем когда-либо.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]И это еще не все![\/b] Мы надеемся добавить больше функций и надеемся, что вам понравится наша игра!\r\n\r\n[h2][b]Подходит ли вам эта игра?[\/b][\/h2]\r\nЕсли вам нравятся сложные платформеры, немного головоломок, создание собственных уровней, конкуренция в таблице лидеров и скоростные прохождения, эта игра для вас!","app[content][short_description]":"The Colorful Creature — это сложная платформенная игра с механикой цветовых головоломок. Испытайте более 300 уровней с разнообразными предметами и опасностями, встроенный редактор уровней, локальный многопользовательский режим, бесконечный бег, настраиваемые скины и шляпы, мастерскую Steam и многое другое.","app[content][sysreqs][mac][min][osversion]":"Получите виртуальную машину Windows, пользователи Apple","app[content][sysreqs][mac][min][processor]":"Возможно, у вас есть процессор Intel","app[content][sysreqs][mac][min][graphics]":"Не знаю","app[content][sysreqs][mac][min][notes]":"Джесси, нам нужна виртуальная машина, Джесси","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (ха-ха)","app[content][sysreqs][windows][min][soundcard]":"Кто вообще этим пользуется???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (ха-ха)","app[content][sysreqs][linux][min][soundcard]":"Кто вообще этим пользуется???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Версия 1.1[\/h2]\r\n- Исправлены достижения и прогресс Steam\r\n- Улучшена поддержка контроллеров\r\n\r\n- Спасибо за вашу поддержку!","app[content][sections][2][content]":"Уровни, созданные потрясающими пользователями!","app[content][sections][3][label]":"Магазин!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"schinese":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature 是一款具有色彩拼图机制的挑战性平台游戏。[\/h2]\r\n\r\n[b]游玩超过350个关卡[\/b]，体验包含多种物品、方块和危险的多样化玩法。有些物品可以改变重力和玩家速度，让你跳得更高，从一个地方传送到另一个地方，还有更多！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]关卡编辑器允许你创建关卡，包含110多个可放置的方块和物品！[\/b] 关卡编辑器的主要功能包括保存\/加载多个关卡、启用雾效、更改音乐、应用叙述文本和游戏\/建造模式切换。数百万种不同的关卡组合，带来无尽的乐趣！最后，你还可以将你的关卡发布到Steam创意工坊！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]本地多人模式可与2、3或4名玩家一起游玩！[\/b] 所有玩家都可以用解锁的皮肤和帽子来定制外观，并通过4个预设改变控制。本地多人模式目前提供两种游戏模式，[b]生存[\/b]和[b]竞速[\/b]，我们计划增加更多模式。所有游戏模式都支持所有玩家。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]如果你想通过手工制作的无限关卡队列进行游玩，请尝试此游戏模式！[\/b] 无尽跑酷模式有三种：普通模式、老派模式和自定义无尽跑酷模式。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\n你可以用皮肤和帽子来定制你的角色。皮肤通过完成各种任务获得，大多数帽子可以在帽子商店中获得！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature 已开源[\/b]，这使得修改代码和进一步改进游戏比以往更加容易\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]这款游戏还有更多功能！[\/b] 我们希望能够添加更多功能，并希望你喜欢我们的游戏！\r\n\r\n[h2][b]这个游戏适合你吗？[\/b][\/h2]\r\n如果你喜欢具有挑战性的游戏平台游戏，喜欢一定程度的拼图游戏，喜欢在游戏中创建自己的关卡，喜欢在排行榜上竞争，喜欢速通，这款游戏适合你！","app[content][short_description]":"The Colorful Creature 是一款具有色彩拼图机制的挑战性平台游戏。体验包含多种物品和危险的300多个关卡，内置关卡编辑器、本地多人模式、无尽跑酷、自定义皮肤和帽子、Steam创意工坊等等多种功能。","app[content][sysreqs][mac][min][osversion]":"获得一个Windows虚拟机，苹果用户","app[content][sysreqs][mac][min][processor]":"你可能有一个英特尔处理器","app[content][sysreqs][mac][min][graphics]":"不知道","app[content][sysreqs][mac][min][notes]":"杰西，我们需要一个虚拟机，杰西","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32位)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (哈哈)","app[content][sysreqs][windows][min][soundcard]":"现在还有人用这个吗???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (哈哈)","app[content][sysreqs][linux][min][soundcard]":"现在还有人用这个吗???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]版本 1.1[\/h2]\r\n- 修复了Steam进度和成就\r\n- 改进了控制器支持\r\n\r\n- 感谢你们的持续支持！","app[content][sections][2][content]":"由令人惊叹的用户创建的关卡！","app[content][sections][3][label]":"商店！","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"latam":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature es un desafiante juego de plataformas con mecánicas de rompecabezas llenas de color.[\/h2]\r\n\r\n[b]Juega más de 350 niveles[\/b] y disfruta de una jugabilidad diversa con varios objetos, bloques y peligros. Algunos objetos pueden cambiar la gravedad y la velocidad del jugador, permitiendo saltos más altos, teletransportación y más!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]El editor de niveles te permite crear tus propios niveles con más de 110 bloques y objetos![\/b] Las funciones principales del editor de niveles incluyen guardar\/cargar múltiples niveles, activar niebla, cambiar la música, agregar textos narrativos y cambiar entre el modo de juego y el modo de construcción. ¡Crea diversión infinita con millones de combinaciones de niveles! Finalmente, puedes publicar tus niveles en el Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]El modo multijugador local te permite jugar con 2, 3 o 4 jugadores![\/b] Cada jugador puede personalizar su apariencia con skins y sombreros desbloqueables y puede cambiar los controles con cuatro opciones predefinidas. Actualmente, el modo multijugador local tiene dos modos de juego: [b]Supervivencia[\/b] y [b]Carrera[\/b], con planes de añadir más modos. Todos los modos de juego admiten a todos los jugadores.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Si quieres correr en niveles infinitos generados manualmente, ¡prueba este modo de juego![\/b] El modo carrera infinita tiene tres variantes: modo normal, modo clásico y carrera infinita personalizada.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nPuedes personalizar tu personaje con skins y sombreros. Los skins se pueden desbloquear completando varias misiones y la mayoría de los sombreros se pueden comprar en la tienda de sombreros!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature es de código abierto[\/b], lo que facilita la modificación del código y la mejora del juego.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]¡Y mucho más en el juego![\/b] Esperamos agregar más funciones y esperamos que disfrutes de nuestro juego!\r\n\r\n[h2][b]¿Es este juego para ti?[\/b][\/h2]\r\nSi te gustan los juegos de plataformas desafiantes con elementos de rompecabezas, si te gusta crear tus propios niveles, competir en tablas de clasificación y hacer speedruns, ¡entonces este juego es para ti!","app[content][short_description]":"The Colorful Creature es un desafiante juego de plataformas con mecánicas de rompecabezas llenas de color. Disfruta de más de 300 niveles con varios objetos y peligros, editor de niveles integrado, multijugador local, carrera infinita, skins y sombreros personalizables, Steam Workshop y más.","app[content][sysreqs][mac][min][osversion]":"Consigue una VM de Windows, usuarios de Apple","app[content][sysreqs][mac][min][processor]":"Probablemente tienes un procesador Intel","app[content][sysreqs][mac][min][graphics]":"Desconocido","app[content][sysreqs][mac][min][notes]":"Jessie, necesitamos una VM, Jessie","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (jaja)","app[content][sysreqs][windows][min][soundcard]":"¿Alguien sigue usando esto???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (jaja)","app[content][sysreqs][linux][min][soundcard]":"¿Alguien sigue usando esto???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versión 1.1[\/h2]\r\n- Mejora en el progreso y logros en Steam\r\n- Mejora en el soporte de controladores\r\n\r\n- ¡Gracias por tu continuo apoyo!","app[content][sections][2][content]":"¡Niveles increíbles creados por usuarios!","app[content][sections][3][label]":"¡Tienda!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"swedish":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature är ett utmanande plattformsspel med färgglada pusselmekaniker.[\/h2]\r\n\r\n[b]Spela genom över 350 nivåer[\/b] och upplev varierande spelupplägg med ett brett utbud av föremål, block och faror. Vissa föremål kan ändra spelarens gravitation och hastighet, vilket möjliggör högre hopp, teleportering och mycket mer!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Nivåredigeraren låter dig skapa egna nivåer med över 110 block och föremål![\/b] De viktigaste funktionerna i nivåredigeraren inkluderar att spara\/ladda flera nivåer, aktivera dimma, ändra musik, lägga till berättande texter och växla mellan spel- och bygglägen. Skapa oändligt med kul med miljontals nivåkombinationer! Slutligen kan du publicera dina nivåer på Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Läget för lokal multiplayer låter dig spela med 2, 3 eller 4 spelare![\/b] Alla spelare kan anpassa sitt utseende med upplåsta skinn och hattar, och ändra kontrollerna med fyra förinställningar. För närvarande har läget för lokal multiplayer två spellägen: [b]Överlevnad[\/b] och [b]Tävling[\/b], med planer på att lägga till fler. Alla spellägen stöder alla spelare.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Om du vill springa genom oändliga handgjorda nivåer, prova detta spelläge![\/b] Oändligt springande-läget har tre varianter: normalläge, klassiskt läge och anpassningsbart oändligt springande-läge.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nDu kan anpassa din karaktär med skinn och hattar. Skinn kan låsas upp genom att slutföra olika uppgifter, och de flesta hattar kan köpas i hattbutiken!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature är öppen källkod[\/b], vilket gör det lättare än någonsin att ändra koden och förbättra spelet.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Och det finns mycket mer i spelet![\/b] Vi hoppas kunna lägga till fler funktioner och hoppas att du njuter av vårt spel!\r\n\r\n[h2][b]Är detta spel för dig?[\/b][\/h2]\r\nOm du gillar utmanande plattformsspel med en touch av pussel, gillar att skapa egna nivåer, tävla på topplistor och göra speedruns, är detta spelet för dig!","app[content][short_description]":"The Colorful Creature är ett utmanande plattformsspel med färgglada pusselmekaniker. Upplev över 300 nivåer med ett brett utbud av föremål och faror, inbyggd nivåredigerare, lokal multiplayer, oändligt springande, anpassningsbara skinn och hattar, Steam Workshop och mer.","app[content][sysreqs][mac][min][osversion]":"Skaffa en Windows VM, Apple-användare","app[content][sysreqs][mac][min][processor]":"Du har förmodligen en Intel-processor","app[content][sysreqs][mac][min][graphics]":"Okänd","app[content][sysreqs][mac][min][notes]":"Jesse, vi behöver en VM, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Använder någon detta fortfarande???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Använder någon detta fortfarande???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Version 1.1[\/h2]\r\n- Framsteg och prestationer åtgärdade på Steam\r\n- Förbättrad handkontrollsstöd\r\n\r\n- Tack för ert fortsatta stöd!","app[content][sections][2][content]":"Fantastiska användarskapade nivåer!","app[content][sections][3][label]":"Butik!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"thai":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature เป็นเกมแพลตฟอร์มที่ท้าทายด้วยกลไกการไขปริศนาสีสัน[\/h2]\r\n\r\n[b]เล่นผ่านด่านกว่า 350 ด่าน[\/b] สัมผัสประสบการณ์การเล่นที่หลากหลายด้วยไอเท็ม บล็อก และอันตรายมากมาย บางไอเท็มสามารถเปลี่ยนแรงโน้มถ่วงและความเร็วของผู้เล่น ทำให้คุณกระโดดสูงขึ้น เทเลพอร์ตจากที่หนึ่งไปยังอีกที่หนึ่ง และอื่นๆ อีกมากมาย!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]ตัวแก้ไขด่านช่วยให้คุณสร้างด่านของคุณเองด้วยบล็อกและไอเท็มกว่า 110 รายการ![\/b] คุณสมบัติหลักของตัวแก้ไขด่านรวมถึงการบันทึก\/โหลดหลายด่าน การเปิดใช้งานหมอก การเปลี่ยนเพลง การเพิ่มข้อความบรรยาย และการสลับโหมดเกม\/การสร้าง สร้างความสนุกไม่มีที่สิ้นสุดด้วยการรวมด่านหลายล้านแบบ! สุดท้าย คุณสามารถเผยแพร่ด่านของคุณไปยัง Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]โหมดผู้เล่นหลายคนในเครื่องช่วยให้คุณเล่นกับผู้เล่น 2, 3 หรือ 4 คนได้![\/b] ผู้เล่นทุกคนสามารถปรับแต่งรูปลักษณ์ด้วยสกินและหมวกที่ปลดล็อกแล้ว และเปลี่ยนการควบคุมด้วยพรีเซ็ตสี่แบบ โหมดผู้เล่นหลายคนในเครื่องปัจจุบันมีสองโหมดการเล่น: [b]เอาตัวรอด[\/b] และ [b]แข่งความเร็ว[\/b] และเราวางแผนที่จะเพิ่มอีก ทุกโหมดการเล่นรองรับผู้เล่นทุกคน\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]หากคุณต้องการเล่นผ่านด่านที่ไม่มีที่สิ้นสุดซึ่งสร้างด้วยมือ ลองโหมดเกมนี้![\/b] โหมด Endless Run มีสามแบบ: โหมดปกติ โหมดเก่า และโหมด Endless Run แบบปรับแต่งได้\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nคุณสามารถปรับแต่งตัวละครของคุณด้วยสกินและหมวก สกินสามารถปลดล็อกได้โดยการทำภารกิจต่างๆ ให้สำเร็จ และหมวกส่วนใหญ่สามารถหาซื้อได้ในร้านหมวก!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature เป็นโอเพนซอร์ส[\/b] ทำให้การแก้ไขโค้ดและปรับปรุงเกมง่ายขึ้นกว่าที่เคย\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]เกมนี้ยังมีอีกมากมาย![\/b] เราหวังว่าจะเพิ่มคุณสมบัติมากขึ้นและหวังว่าคุณจะสนุกกับเกมของเรา!\r\n\r\n[h2][b]เกมนี้เหมาะกับคุณหรือไม่?[\/b][\/h2]\r\nหากคุณชอบเกมแพลตฟอร์มที่ท้าทาย ชอบการไขปริศนาเล็กน้อย ชอบสร้างด่านของคุณเอง ชอบการแข่งขันในกระดานผู้นำ และชอบการวิ่งเร็ว เกมนี้เหมาะกับคุณ!","app[content][short_description]":"The Colorful Creature เป็นเกมแพลตฟอร์มที่ท้าทายด้วยกลไกการไขปริศนาสีสัน สัมผัสประสบการณ์ด่านกว่า 300 ด่านที่มีไอเท็มและอันตรายมากมาย ตัวแก้ไขด่านในตัว โหมดผู้เล่นหลายคนในเครื่อง การวิ่งแบบไม่มีที่สิ้นสุด สกินและหมวกแบบปรับแต่งได้ Steam Workshop และอีกมากมาย","app[content][sysreqs][mac][min][osversion]":"รับ Windows VM ผู้ใช้ Apple","app[content][sysreqs][mac][min][processor]":"คุณอาจมีโปรเซสเซอร์ Intel","app[content][sysreqs][mac][min][graphics]":"ไม่รู้","app[content][sysreqs][mac][min][notes]":"เจสซี เราต้องการ VM เจสซี","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (ฮ่าฮ่า)","app[content][sysreqs][windows][min][soundcard]":"ยังมีใครใช้อยู่มั้ย???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (ฮ่าฮ่า)","app[content][sysreqs][linux][min][soundcard]":"ยังมีใครใช้อยู่มั้ย???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]เวอร์ชัน 1.1[\/h2]\r\n- แก้ไขความคืบหน้าและความสำเร็จของ Steam\r\n- ปรับปรุงการสนับสนุนคอนโทรลเลอร์\r\n\r\n- ขอบคุณสำหรับการสนับสนุนอย่างต่อเนื่องของคุณ!","app[content][sections][2][content]":"ด่านที่สร้างโดยผู้ใช้ที่น่าทึ่ง!","app[content][sections][3][label]":"ร้านค้า!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"tchinese":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature 是一款具有色彩拼圖機制的挑戰性平台遊戲。[\/h2]\r\n\r\n[b]遊玩超過350個關卡[\/b]，體驗包含多種物品、方塊和危險的多樣化玩法。有些物品可以改變重力和玩家速度，讓你跳得更高，從一個地方傳送到另一個地方，還有更多！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]關卡編輯器允許你創建關卡，包含110多個可放置的方塊和物品！[\/b] 關卡編輯器的主要功能包括保存\/加載多個關卡、啟用霧效、更改音樂、應用敘述文本和遊戲\/建造模式切換。數百萬種不同的關卡組合，帶來無盡的樂趣！最後，你還可以將你的關卡發布到Steam創意工坊！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]本地多人模式可與2、3或4名玩家一起遊玩！[\/b] 所有玩家都可以用解鎖的皮膚和帽子來定制外觀，並通過4個預設改變控制。本地多人模式目前提供兩種遊戲模式，[b]生存[\/b]和[b]競速[\/b]，我們計劃增加更多模式。所有遊戲模式都支持所有玩家。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]如果你想通過手工製作的無限關卡隊列進行遊玩，請嘗試此遊戲模式！[\/b] 無盡跑酷模式有三種：普通模式、老派模式和自定義無盡跑酷模式。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\n你可以用皮膚和帽子來定制你的角色。皮膚通過完成各種任務獲得，大多數帽子可以在帽子商店中獲得！\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature 已開源[\/b]，這使得修改代碼和進一步改進遊戲比以往更加容易。\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]這款遊戲還有更多功能！[\/b] 我們希望能夠添加更多功能，並希望你喜歡我們的遊戲！\r\n\r\n[h2][b]這個遊戲適合你嗎？[\/b][\/h2]\r\n如果你喜歡具有挑戰性的平臺遊戲，喜歡一定程度的拼圖遊戲，喜歡在遊戲中創建自己的關卡，喜歡在排行榜上競爭，喜歡速通，這款遊戲適合你！","app[content][short_description]":"The Colorful Creature 是一款具有色彩拼圖機制的挑戰性平台遊戲。體驗包含多種物品和危險的300多個關卡，內置關卡編輯器、本地多人模式、無盡跑酷、自定義皮膚和帽子、Steam創意工坊等等多種功能。","app[content][sysreqs][mac][min][osversion]":"獲得一個Windows虛擬機，蘋果用戶","app[content][sysreqs][mac][min][processor]":"你可能有一個英特爾處理器","app[content][sysreqs][mac][min][graphics]":"不知道","app[content][sysreqs][mac][min][notes]":"傑西，我們需要一個虛擬機，傑西","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32位)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (哈哈)","app[content][sysreqs][windows][min][soundcard]":"現在還有人用這個嗎???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (哈哈)","app[content][sysreqs][linux][min][soundcard]":"現在還有人用這個嗎???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]版本 1.1[\/h2]\r\n- 修復了Steam進度和成就\r\n- 改進了控制器支持\r\n\r\n- 感謝你們的持續支持！","app[content][sections][2][content]":"由令人驚嘆的用戶創建的關卡！","app[content][sections][3][label]":"商店！","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"turkish":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature, renkli bulmaca mekanikleriyle zorlu bir platform oyunudur.[\/h2]\r\n\r\n[b]350'den fazla seviyede oyna[\/b] ve çeşitli nesneler, bloklar ve tehlikelerle dolu bir oyun deneyimi yaşa. Bazı nesneler, oyuncunun yer çekimini ve hızını değiştirebilir, bu da daha yüksek sıçramalar, ışınlanma ve daha fazlasını sağlar!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Seviye editörü, 110'dan fazla blok ve nesne ile kendi seviyelerini oluşturmanı sağlar![\/b] Seviye editörünün ana özellikleri arasında birden fazla seviyeyi kaydetme\/yükleme, sis etkinleştirme, müzik değiştirme, anlatı metinleri ekleme ve oyun ile yapı modu arasında geçiş yapma bulunur. Milyonlarca seviye kombinasyonuyla sonsuz eğlence yarat! Son olarak, kendi seviyelerini Steam Workshop'a yükleyebilirsin!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Yerel çok oyunculu mod, 2, 3 veya 4 oyuncuyla oynamana olanak tanır![\/b] Tüm oyuncular, kilidi açılabilir skinler ve şapkalar ile görünümlerini kişiselleştirebilir ve dört ön ayarlı seçenekle kontrolleri değiştirebilir. Şu anda yerel çok oyunculu modda iki oyun modu bulunmaktadır: [b]Hayatta Kalma[\/b] ve [b]Yarış[\/b], ve daha fazla mod eklenmesi planlanmaktadır. Tüm oyun modları tüm oyuncuları destekler.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]El yapımı sonsuz seviyelerde koşmak istiyorsan, bu oyun modunu dene![\/b] Sonsuz koşu modu, normal mod, klasik mod ve özelleştirilebilir sonsuz koşu olmak üzere üç varyanta sahiptir.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nKarakterini skinler ve şapkalarla kişiselleştirebilirsin. Skinler, çeşitli görevleri tamamlayarak açılabilir ve çoğu şapka şapka mağazasından satın alınabilir!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature açık kaynaklıdır[\/b], bu da oyunun kodunu değiştirip iyileştirmeyi daha da kolaylaştırır.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Ve oyunda çok daha fazlası var![\/b] Daha fazla özellik eklemeyi umuyoruz ve umarız oyunumuzdan keyif alırsın!\r\n\r\n[h2][b]Bu oyun senin için mi?[\/b][\/h2]\r\nEğer bulmaca parçacıkları içeren zorlu platform oyunlarını seviyorsan, kendi seviyelerini oluşturmayı seviyorsan, liderlik tablolarında rekabet etmeyi ve hız koşusu yapmayı seviyorsan, o zaman bu oyun tam sana göre!","app[content][short_description]":"The Colorful Creature, renkli bulmaca mekanikleriyle zorlu bir platform oyunudur. 300'den fazla seviyede çeşitli nesneler ve tehlikelerle dolu bir oyun deneyimi, yerleşik seviye editörü, yerel çok oyunculu mod, sonsuz koşu, özelleştirilebilir skinler ve şapkalar, Steam Workshop ve çok daha fazlasının keyfini çıkar.","app[content][sysreqs][mac][min][osversion]":"Apple kullanıcıları, bir Windows VM edinin","app[content][sysreqs][mac][min][processor]":"Muhtemelen bir Intel işlemciniz var","app[content][sysreqs][mac][min][graphics]":"Bilinmiyor","app[content][sysreqs][mac][min][notes]":"Jesse, bir VM'ye ihtiyacımız var, Jesse","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Bunu hala kullanan var mı???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Bunu hala kullanan var mı???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Versiyon 1.1[\/h2]\r\n- Steam'de ilerleme ve başarımlar düzeltildi\r\n- Geliştirilmiş kontrolcü desteği\r\n\r\n- Sürekli desteğiniz için teşekkür ederiz!","app[content][sections][2][content]":"Harika kullanıcı seviyeleri!","app[content][sections][3][label]":"Mağaza!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"ukrainian":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature - це складна платформна гра з яскравими головоломками.[\/h2]\r\n\r\n[b]Грайте в понад 350 рівнів[\/b] і насолоджуйтеся різноманітним геймплеєм з різними об'єктами, блоками та небезпеками. Деякі об'єкти можуть змінювати гравітацію та швидкість гравця, дозволяючи робити вищі стрибки, телепортуватися та багато іншого!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Редактор рівнів дозволяє створювати власні рівні з понад 110 блоками та об'єктами![\/b] Основні функції редактора рівнів включають збереження\/завантаження кількох рівнів, увімкнення туману, зміну музики, додавання текстових оповідань та перемикання між ігровим та будівельним режимами. Створіть безкінечну забаву з мільйонами комбінацій рівнів! І нарешті, ви можете публікувати свої рівні в Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Локальний мультиплеєр дозволяє грати з 2, 3 або 4 гравцями![\/b] Кожен гравець може налаштувати свій зовнішній вигляд за допомогою розблокованих скінів та капелюхів і змінити управління з чотирма попередньо заданими варіантами. На даний момент локальний мультиплеєр має два режими гри: [b]Виживання[\/b] та [b]Гонка[\/b], з планами додати більше режимів. Усі режими гри підтримують усіх гравців.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Якщо ви хочете бігати на ручних нескінченних рівнях, спробуйте цей режим гри![\/b] Режим нескінченного бігу має три варіанти: звичайний режим, класичний режим та настроюваний нескінченний біг.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nВи можете налаштувати свого персонажа за допомогою скінів та капелюхів. Скіни можна розблокувати, виконуючи різні завдання, а більшість капелюхів можна придбати в магазині капелюхів!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature є з відкритим вихідним кодом[\/b], що дозволяє легко модифікувати код та покращувати гру. \r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]І ще багато іншого в грі![\/b] Ми сподіваємося додати більше функцій та сподіваємося, що ви насолодитеся нашою грою!\r\n\r\n[h2][b]Ця гра для вас?[\/b][\/h2]\r\nЯкщо ви любите складні платформні ігри з елементами головоломок, любите створювати власні рівні, змагатися у таблицях лідерів та робити спідрани, то ця гра для вас!","app[content][short_description]":"The Colorful Creature - це складна платформна гра з яскравими головоломками. Насолоджуйтесь понад 300 рівнями з різноманітними об'єктами та небезпеками, вбудованим редактором рівнів, локальним мультиплеєром, нескінченним бігом, налаштовуваними скінами та капелюхами, Steam Workshop та багато іншого.","app[content][sysreqs][mac][min][osversion]":"Отримайте Windows VM, користувачі Apple","app[content][sysreqs][mac][min][processor]":"Ймовірно, у вас процесор Intel","app[content][sysreqs][mac][min][graphics]":"Невідомо","app[content][sysreqs][mac][min][notes]":"Джессі, нам потрібна VM, Джессі","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (ха-ха)","app[content][sysreqs][windows][min][soundcard]":"Хтось ще користується цим???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (ха-ха)","app[content][sysreqs][linux][min][soundcard]":"Хтось ще користується цим???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Версія 1.1[\/h2]\r\n- Поліпшення прогресу та досягнень у Steam\r\n- Поліпшена підтримка контролерів\r\n\r\n- Дякуємо за постійну підтримку!","app[content][sections][2][content]":"Дивовижні рівні від користувачів!","app[content][sections][3][label]":"Магазин!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""},"vietnamese":{"app[content][about]":"[img]{STEAM_APP_IMAGE}\/extras\/TheGame.png[\/img]\r\n[h2]The Colorful Creature là một trò chơi nền tảng thử thách với các cơ chế giải đố đầy màu sắc.[\/h2]\r\n\r\n[b]Chơi qua hơn 350 cấp độ[\/b] và thưởng thức gameplay đa dạng với nhiều vật phẩm, khối và nguy hiểm khác nhau. Một số vật phẩm có thể thay đổi trọng lực và tốc độ của người chơi, cho phép nhảy cao hơn, dịch chuyển tức thời và nhiều hơn nữa!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LevelEditor.png[\/img]\r\n\r\n[b]Trình chỉnh sửa cấp độ cho phép bạn tạo các cấp độ của riêng mình với hơn 110 khối và vật phẩm![\/b] Các tính năng chính của trình chỉnh sửa cấp độ bao gồm lưu\/tải nhiều cấp độ, bật sương mù, thay đổi nhạc, thêm văn bản kể chuyện và chuyển đổi giữa chế độ chơi và chế độ xây dựng. Tạo niềm vui vô tận với hàng triệu sự kết hợp cấp độ! Cuối cùng, bạn có thể xuất bản các cấp độ của mình trên Steam Workshop!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/LocalMultiplayer.png[\/img]\r\n\r\n[b]Chế độ chơi nhiều người cục bộ cho phép bạn chơi với 2, 3 hoặc 4 người chơi![\/b] Mỗi người chơi có thể tùy chỉnh giao diện của mình bằng cách mở khóa giao diện và mũ và có thể thay đổi điều khiển với bốn tùy chọn cài đặt sẵn. Hiện tại, chế độ chơi nhiều người cục bộ có hai chế độ chơi: [b]Sinh tồn[\/b] và [b]Cuộc đua[\/b], với kế hoạch thêm nhiều chế độ hơn. Tất cả các chế độ chơi đều hỗ trợ tất cả người chơi.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/EndlessRun.png[\/img]\r\n\r\n[b]Nếu bạn muốn chạy trên các cấp độ thủ công vô tận, hãy thử chế độ chơi này![\/b] Chế độ chạy vô tận có ba biến thể: chế độ thông thường, chế độ cổ điển và chế độ chạy vô tận tùy chỉnh.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/Skins.png[\/img]\r\n\r\nBạn có thể tùy chỉnh nhân vật của mình bằng các giao diện và mũ. Các giao diện có thể được mở khóa bằng cách hoàn thành các nhiệm vụ khác nhau và hầu hết các mũ có thể được mua từ cửa hàng mũ!\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/OpenSourced.png[\/img]\r\n\r\n[b]The Colorful Creature là mã nguồn mở[\/b], giúp việc sửa đổi mã và cải tiến trò chơi trở nên dễ dàng hơn.\r\n\r\n[img]{STEAM_APP_IMAGE}\/extras\/AndWayMore.png[\/img]\r\n\r\n[b]Và còn nhiều hơn nữa trong trò chơi![\/b] Chúng tôi hy vọng sẽ thêm nhiều tính năng hơn nữa và hy vọng bạn sẽ thưởng thức trò chơi của chúng tôi!\r\n\r\n[h2][b]Trò chơi này có dành cho bạn không?[\/b][\/h2]\r\nNếu bạn thích các trò chơi nền tảng thử thách với yếu tố giải đố, nếu bạn thích tạo cấp độ của riêng mình, cạnh tranh trong bảng xếp hạng và thực hiện chạy nhanh, thì trò chơi này dành cho bạn!","app[content][short_description]":"The Colorful Creature là một trò chơi nền tảng thử thách với các cơ chế giải đố đầy màu sắc. Thưởng thức hơn 300 cấp độ với các vật phẩm và nguy hiểm đa dạng, trình chỉnh sửa cấp độ tích hợp, chế độ chơi nhiều người cục bộ, chạy vô tận, các giao diện và mũ tùy chỉnh, Steam Workshop và nhiều hơn nữa.","app[content][sysreqs][mac][min][osversion]":"Lấy một Windows VM, người dùng Apple","app[content][sysreqs][mac][min][processor]":"Chắc chắn bạn có bộ xử lý Intel","app[content][sysreqs][mac][min][graphics]":"Không rõ","app[content][sysreqs][mac][min][notes]":"Jessie, chúng ta cần một VM, Jessie","app[content][sysreqs][windows][min][osversion]":"Windows Vista (32-bit)","app[content][sysreqs][windows][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][windows][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][windows][min][soundcard]":"Có ai còn dùng cái này không???","app[content][sysreqs][linux][min][osversion]":"Ubuntu 11.04","app[content][sysreqs][linux][min][processor]":"AMD E2-9000e Radeon","app[content][sysreqs][linux][min][graphics]":"NVIDIA GeForce G100 (haha)","app[content][sysreqs][linux][min][soundcard]":"Có ai còn dùng cái này không???","app[content][sections][0][label]":"#label_update_notes","app[content][sections][0][content]":"","app[content][sections][1][label]":"","app[content][sections][1][content]":"[h2]Phiên bản 1.1[\/h2]\r\n- Cải thiện tiến độ và thành tựu trên Steam\r\n- Cải thiện hỗ trợ bộ điều khiển\r\n\r\n- Cảm ơn vì sự hỗ trợ liên tục của bạn!","app[content][sections][2][content]":"Các cấp độ tuyệt vời từ người dùng!","app[content][sections][3][label]":"Cửa hàng!","app[item_store][filters][0][localization]":"","app[item_store][filters][1][localization]":"","app[item_store][filters][2][localization]":"","app[item_store][filters][3][localization]":"","app[item_store][filters][4][localization]":""}}}